www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
  /* Disable the timer output */
  hhrtim->Instance->sCommonRegs.ODISR |= OCChannel;

  /* Disable the timer counter */
  __HAL_HRTIM_DISABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start the output compare signal generation on the designed timer
 * output (Interrupt is enabled (see note note below)).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @note Interrupt enabling depends on the chosen output compare mode
 *          Output toggle: compare match interrupt is enabled
 *          Output set active:  output set interrupt is enabled
 *          Output set inactive:  output reset interrupt is enabled
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_SimpleOCStart_IT(HRTIM_HandleTypeDef *hhrtim,
                                             uint32_t TimerIdx,
                                             uint32_t OCChannel) {
  uint32_t interrupt;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OCChannel));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Get the interrupt to enable (depends on the output compare mode) */
  interrupt = HRTIM_GetITFromOCMode(hhrtim, TimerIdx, OCChannel);

  /* Enable the timer output */
  hhrtim->Instance->sCommonRegs.OENR |= OCChannel;

  /* Enable the timer interrupt (depends on the output compare mode) */
  __HAL_HRTIM_TIMER_ENABLE_IT(hhrtim, TimerIdx, interrupt);

  /* Enable the timer counter */
  __HAL_HRTIM_ENABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Stop the output compare signal generation on the designed timer
 * output (Interrupt is disabled).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_SimpleOCStop_IT(HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx,
                                            uint32_t OCChannel) {
  uint32_t interrupt;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OCChannel));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Disable the timer output */
  hhrtim->Instance->sCommonRegs.ODISR |= OCChannel;

  /* Get the interrupt to disable (depends on the output compare mode) */
  interrupt = HRTIM_GetITFromOCMode(hhrtim, TimerIdx, OCChannel);

  /* Disable the timer interrupt */
  __HAL_HRTIM_TIMER_DISABLE_IT(hhrtim, TimerIdx, interrupt);

  /* Disable the timer counter */
  __HAL_HRTIM_DISABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start the output compare signal generation on the designed timer
 * output (DMA request is enabled (see note below)).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @param  SrcAddr DMA transfer source address
 * @param  DestAddr DMA transfer destination address
 * @param  Length The length of data items (data size) to be transferred
 *                     from source to destination
 * @note  DMA request enabling depends on the chosen output compare mode
 *          Output toggle: compare match DMA request is enabled
 *          Output set active:  output set DMA request is enabled
 *          Output set inactive:  output reset DMA request is enabled
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_SimpleOCStart_DMA(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                            uint32_t OCChannel, uint32_t SrcAddr,
                            uint32_t DestAddr, uint32_t Length) {
  DMA_HandleTypeDef *hdma;
  uint32_t dma_request;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OCChannel));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }
  if (hhrtim->State == HAL_HRTIM_STATE_READY) {
    if ((SrcAddr == 0U) || (DestAddr == 0U) || (Length == 0U)) {
      return HAL_ERROR;
    } else {
      hhrtim->State = HAL_HRTIM_STATE_BUSY;
    }
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

