www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
  /* Enable the timer output */
  hhrtim->Instance->sCommonRegs.OENR |= OnePulseChannel;

  /* Enable the timer interrupt (depends on the OnePulse output) */
  switch (OnePulseChannel) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    __HAL_HRTIM_TIMER_ENABLE_IT(hhrtim, TimerIdx, HRTIM_TIM_IT_CMP1);
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    __HAL_HRTIM_TIMER_ENABLE_IT(hhrtim, TimerIdx, HRTIM_TIM_IT_CMP2);
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  /* Enable the timer counter */
  __HAL_HRTIM_ENABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Disable the simple one pulse signal generation on the designed output
 *         (The compare interrupt is disabled).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  OnePulseChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_SimpleOnePulseStop_IT(HRTIM_HandleTypeDef *hhrtim,
                                                  uint32_t TimerIdx,
                                                  uint32_t OnePulseChannel) {
  /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OnePulseChannel));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Disable the timer output */
  hhrtim->Instance->sCommonRegs.ODISR |= OnePulseChannel;

  /* Disable the timer interrupt (depends on the OnePulse output) */
  switch (OnePulseChannel) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    __HAL_HRTIM_TIMER_DISABLE_IT(hhrtim, TimerIdx, HRTIM_TIM_IT_CMP1);
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    __HAL_HRTIM_TIMER_DISABLE_IT(hhrtim, TimerIdx, HRTIM_TIM_IT_CMP2);
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  /* Disable the timer counter */
  __HAL_HRTIM_DISABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @}
 */

/** @defgroup HRTIM_Exported_Functions_Group7 Configuration functions
 *  @brief    HRTIM configuration functions
@verbatim
 ===============================================================================
              ##### HRTIM configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to configure the HRTIM
          resources shared by all the HRTIM timers operating in waveform mode:
      (+) Configure the burst mode controller
      (+) Configure an external event conditioning
      (+) Configure the external events sampling clock
      (+) Configure a fault conditioning
      (+) Enable or disable fault inputs
      (+) Configure the faults sampling clock
      (+) Configure an ADC trigger

@endverbatim
  * @{
  */

/**
 * @brief  Configure the burst mode feature of the HRTIM
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  pBurstModeCfg pointer to the burst mode configuration structure
 * @retval HAL status
 * @note This function must be called before starting the burst mode
 *       controller
 */
HAL_StatusTypeDef
HAL_HRTIM_BurstModeConfig(HRTIM_HandleTypeDef *hhrtim,
                          const HRTIM_BurstModeCfgTypeDef *pBurstModeCfg) {
  uint32_t hrtim_bmcr;

  /* Check parameters */
  assert_param(IS_HRTIM_BURSTMODE(pBurstModeCfg->Mode));
  assert_param(IS_HRTIM_BURSTMODECLOCKSOURCE(pBurstModeCfg->ClockSource));
  assert_param(IS_HRTIM_HRTIM_BURSTMODEPRESCALER(pBurstModeCfg->Prescaler));
  assert_param(IS_HRTIM_BURSTMODEPRELOAD(pBurstModeCfg->PreloadEnable));
  assert_param(IS_HRTIM_BURSTMODETRIGGER(pBurstModeCfg->Trigger));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  hrtim_bmcr = hhrtim->Instance->sCommonRegs.BMCR;

  /* Set the burst mode operating mode */
  hrtim_bmcr &= ~(HRTIM_BMCR_BMOM);
  hrtim_bmcr |= (pBurstModeCfg->Mode & HRTIM_BMCR_BMOM);

  /* Set the burst mode clock source */
  hrtim_bmcr &= ~(HRTIM_BMCR_BMCLK);
  hrtim_bmcr |= (pBurstModeCfg->ClockSource & HRTIM_BMCR_BMCLK);

  /* Set the burst mode prescaler */
  hrtim_bmcr &= ~(HRTIM_BMCR_BMPRSC);
  hrtim_bmcr |= pBurstModeCfg->Prescaler;

  /* Enable/disable burst mode registers preload */
  hrtim_bmcr &= ~(HRTIM_BMCR_BMPREN);
  hrtim_bmcr |= (pBurstModeCfg->PreloadEnable & HRTIM_BMCR_BMPREN);

  /* Set the burst mode trigger */
  hhrtim->Instance->sCommonRegs.BMTRGR = pBurstModeCfg->Trigger;

  /* Set the burst mode compare value */
  hhrtim->Instance->sCommonRegs.BMCMPR = pBurstModeCfg->IdleDuration;

  /* Set the burst mode period */
  hhrtim->Instance->sCommonRegs.BMPER = pBurstModeCfg->Period;

  /* Update the HRTIM registers */
  hhrtim->Instance->sCommonRegs.BMCR = hrtim_bmcr;

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the conditioning of an external event
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Event external event to configure
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_EVENT_NONE: no external Event
 *                    @arg HRTIM_EVENT_1: External event 1
 *                    @arg HRTIM_EVENT_2: External event 2
 *                    @arg HRTIM_EVENT_3: External event 3
 *                    @arg HRTIM_EVENT_4: External event 4
 *                    @arg HRTIM_EVENT_5: External event 5
 *                    @arg HRTIM_EVENT_6: External event 6
 *                    @arg HRTIM_EVENT_7: External event 7
 *                    @arg HRTIM_EVENT_8: External event 8
 *                    @arg HRTIM_EVENT_9: External event 9
 *                    @arg HRTIM_EVENT_10: External event 10
 * @param  pEventCfg pointer to the event conditioning configuration structure
 * @note This function must be called before starting the timer
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_EventConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t Event,
                      const HRTIM_EventCfgTypeDef *pEventCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_EVENT(Event));
  assert_param(IS_HRTIM_EVENTSRC(pEventCfg->Source));
  assert_param(
      IS_HRTIM_EVENTPOLARITY(pEventCfg->Sensitivity, pEventCfg->Polarity));
  assert_param(IS_HRTIM_EVENTSENSITIVITY(pEventCfg->Sensitivity));
  assert_param(IS_HRTIM_EVENTFASTMODE(Event, pEventCfg->FastMode));
  assert_param(IS_HRTIM_EVENTFILTER(Event, pEventCfg->Filter));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure the event channel */
  HRTIM_EventConfig(hhrtim, Event, pEventCfg);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the external event conditioning block prescaler
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Prescaler Prescaler value
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_EVENTPRESCALER_DIV1: fEEVS=fHRTIM
 *                    @arg HRTIM_EVENTPRESCALER_DIV2: fEEVS=fHRTIM / 2
 *                    @arg HRTIM_EVENTPRESCALER_DIV4: fEEVS=fHRTIM / 4
 *                    @arg HRTIM_EVENTPRESCALER_DIV8: fEEVS=fHRTIM / 8
 * @note This function must be called before starting the timer
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_EventPrescalerConfig(HRTIM_HandleTypeDef *hhrtim,
                                                 uint32_t Prescaler) {
  /* Check parameters */
  assert_param(IS_HRTIM_EVENTPRESCALER(Prescaler));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Set the external event prescaler */
  MODIFY_REG(hhrtim->Instance->sCommonRegs.EECR3, HRTIM_EECR3_EEVSD,
             (Prescaler & HRTIM_EECR3_EEVSD));

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the conditioning of fault input
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Fault fault input to configure
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_FAULT_1: Fault input 1
 *                    @arg HRTIM_FAULT_2: Fault input 2
 *                    @arg HRTIM_FAULT_3: Fault input 3
 *                    @arg HRTIM_FAULT_4: Fault input 4
 *                    @arg HRTIM_FAULT_5: Fault input 5
 * @param  pFaultCfg pointer to the fault conditioning configuration structure
 * @note This function must be called before starting the timer and before
 *       enabling faults inputs
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_FaultConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t Fault,
                      const HRTIM_FaultCfgTypeDef *pFaultCfg) {
  uint32_t hrtim_fltinr1;
  uint32_t hrtim_fltinr2;

  /* Check parameters */
  assert_param(IS_HRTIM_FAULT(Fault));
  assert_param(IS_HRTIM_FAULTSOURCE(pFaultCfg->Source));
  assert_param(IS_HRTIM_FAULTPOLARITY(pFaultCfg->Polarity));
  assert_param(IS_HRTIM_FAULTFILTER(pFaultCfg->Filter));
  assert_param(IS_HRTIM_FAULTLOCK(pFaultCfg->Lock));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure fault channel */
  hrtim_fltinr1 = hhrtim->Instance->sCommonRegs.FLTINR1;
  hrtim_fltinr2 = hhrtim->Instance->sCommonRegs.FLTINR2;

  switch (Fault) {
  case HRTIM_FAULT_1: {
    hrtim_fltinr1 &= ~(HRTIM_FLTINR1_FLT1P | HRTIM_FLTINR1_FLT1SRC |
                       HRTIM_FLTINR1_FLT1F | HRTIM_FLTINR1_FLT1LCK);
    hrtim_fltinr1 |= (pFaultCfg->Polarity & HRTIM_FLTINR1_FLT1P);
    hrtim_fltinr1 |= (pFaultCfg->Source & HRTIM_FLTINR1_FLT1SRC);
    hrtim_fltinr1 |= (pFaultCfg->Filter & HRTIM_FLTINR1_FLT1F);
    hrtim_fltinr1 |= (pFaultCfg->Lock & HRTIM_FLTINR1_FLT1LCK);
    break;
  }

  case HRTIM_FAULT_2: {
    hrtim_fltinr1 &= ~(HRTIM_FLTINR1_FLT2P | HRTIM_FLTINR1_FLT2SRC |
                       HRTIM_FLTINR1_FLT2F | HRTIM_FLTINR1_FLT2LCK);
    hrtim_fltinr1 |= ((pFaultCfg->Polarity << 8U) & HRTIM_FLTINR1_FLT2P);
    hrtim_fltinr1 |= ((pFaultCfg->Source << 8U) & HRTIM_FLTINR1_FLT2SRC);
    hrtim_fltinr1 |= ((pFaultCfg->Filter << 8U) & HRTIM_FLTINR1_FLT2F);
    hrtim_fltinr1 |= ((pFaultCfg->Lock << 8U) & HRTIM_FLTINR1_FLT2LCK);
    break;
  }

  case HRTIM_FAULT_3: {
    hrtim_fltinr1 &= ~(HRTIM_FLTINR1_FLT3P | HRTIM_FLTINR1_FLT3SRC |
                       HRTIM_FLTINR1_FLT3F | HRTIM_FLTINR1_FLT3LCK);
    hrtim_fltinr1 |= ((pFaultCfg->Polarity << 16U) & HRTIM_FLTINR1_FLT3P);
    hrtim_fltinr1 |= ((pFaultCfg->Source << 16U) & HRTIM_FLTINR1_FLT3SRC);
    hrtim_fltinr1 |= ((pFaultCfg->Filter << 16U) & HRTIM_FLTINR1_FLT3F);
    hrtim_fltinr1 |= ((pFaultCfg->Lock << 16U) & HRTIM_FLTINR1_FLT3LCK);
    break;
  }

  case HRTIM_FAULT_4: {
    hrtim_fltinr1 &= ~(HRTIM_FLTINR1_FLT4P | HRTIM_FLTINR1_FLT4SRC |
                       HRTIM_FLTINR1_FLT4F | HRTIM_FLTINR1_FLT4LCK);
    hrtim_fltinr1 |= ((pFaultCfg->Polarity << 24U) & HRTIM_FLTINR1_FLT4P);
    hrtim_fltinr1 |= ((pFaultCfg->Source << 24U) & HRTIM_FLTINR1_FLT4SRC);
    hrtim_fltinr1 |= ((pFaultCfg->Filter << 24U) & HRTIM_FLTINR1_FLT4F);
    hrtim_fltinr1 |= ((pFaultCfg->Lock << 24U) & HRTIM_FLTINR1_FLT4LCK);
    break;
  }

  case HRTIM_FAULT_5: {
    hrtim_fltinr2 &= ~(HRTIM_FLTINR2_FLT5P | HRTIM_FLTINR2_FLT5SRC |
                       HRTIM_FLTINR2_FLT5F | HRTIM_FLTINR2_FLT5LCK);
    hrtim_fltinr2 |= (pFaultCfg->Polarity & HRTIM_FLTINR2_FLT5P);
    hrtim_fltinr2 |= (pFaultCfg->Source & HRTIM_FLTINR2_FLT5SRC);
    hrtim_fltinr2 |= (pFaultCfg->Filter & HRTIM_FLTINR2_FLT5F);
    hrtim_fltinr2 |= (pFaultCfg->Lock & HRTIM_FLTINR2_FLT5LCK);
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

