www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
  case HRTIM_EVENT_6: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2,
        (HRTIM_EEFR2_EE6FLTR | HRTIM_EEFR2_EE6LTCH),
        (pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch));
    break;
  }

  case HRTIM_EVENT_7: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2,
        (HRTIM_EEFR2_EE7FLTR | HRTIM_EEFR2_EE7LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 6U));
    break;
  }

  case HRTIM_EVENT_8: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2,
        (HRTIM_EEFR2_EE8FLTR | HRTIM_EEFR2_EE8LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 12U));
    break;
  }

  case HRTIM_EVENT_9: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2,
        (HRTIM_EEFR2_EE9FLTR | HRTIM_EEFR2_EE9LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 18U));
    break;
  }

  case HRTIM_EVENT_10: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2,
        (HRTIM_EEFR2_EE10FLTR | HRTIM_EEFR2_EE10LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 24U));
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the dead-time insertion feature for a timer
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  pDeadTimeCfg pointer to the deadtime insertion configuration
 * structure
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef
HAL_HRTIM_DeadTimeConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                         const HRTIM_DeadTimeCfgTypeDef *pDeadTimeCfg) {
  uint32_t hrtim_dtr;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_TIMDEADTIME_PRESCALERRATIO(pDeadTimeCfg->Prescaler));
  assert_param(IS_HRTIM_TIMDEADTIME_RISINGSIGN(pDeadTimeCfg->RisingSign));
  assert_param(IS_HRTIM_TIMDEADTIME_RISINGLOCK(pDeadTimeCfg->RisingLock));
  assert_param(
      IS_HRTIM_TIMDEADTIME_RISINGSIGNLOCK(pDeadTimeCfg->RisingSignLock));
  assert_param(IS_HRTIM_TIMDEADTIME_FALLINGSIGN(pDeadTimeCfg->FallingSign));
  assert_param(IS_HRTIM_TIMDEADTIME_FALLINGLOCK(pDeadTimeCfg->FallingLock));
  assert_param(
      IS_HRTIM_TIMDEADTIME_FALLINGSIGNLOCK(pDeadTimeCfg->FallingSignLock));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Set timer deadtime configuration */
  hrtim_dtr = (pDeadTimeCfg->Prescaler & HRTIM_DTR_DTPRSC);
  hrtim_dtr |= (pDeadTimeCfg->RisingValue & HRTIM_DTR_DTR);
  hrtim_dtr |= (pDeadTimeCfg->RisingSign & HRTIM_DTR_SDTR);
  hrtim_dtr |= (pDeadTimeCfg->RisingSignLock & HRTIM_DTR_DTRSLK);
  hrtim_dtr |= (pDeadTimeCfg->RisingLock & HRTIM_DTR_DTRLK);
  hrtim_dtr |= ((pDeadTimeCfg->FallingValue << 16U) & HRTIM_DTR_DTF);
  hrtim_dtr |= (pDeadTimeCfg->FallingSign & HRTIM_DTR_SDTF);
  hrtim_dtr |= (pDeadTimeCfg->FallingSignLock & HRTIM_DTR_DTFSLK);
  hrtim_dtr |= (pDeadTimeCfg->FallingLock & HRTIM_DTR_DTFLK);

  /* Update the HRTIM registers */
  MODIFY_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].DTxR,
             (HRTIM_DTR_DTR | HRTIM_DTR_SDTR | HRTIM_DTR_DTPRSC |
              HRTIM_DTR_DTRSLK | HRTIM_DTR_DTRLK | HRTIM_DTR_DTF |
              HRTIM_DTR_SDTF | HRTIM_DTR_DTFSLK | HRTIM_DTR_DTFLK),
             hrtim_dtr);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the chopper mode feature for a timer
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  pChopperModeCfg pointer to the chopper mode configuration structure
 * @retval HAL status
 * @note This function must be called before configuring the timer output(s)
 */
HAL_StatusTypeDef HAL_HRTIM_ChopperModeConfig(
    HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
    const HRTIM_ChopperModeCfgTypeDef *pChopperModeCfg) {
  uint32_t hrtim_chpr;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_CHOPPER_PRESCALERRATIO(pChopperModeCfg->CarrierFreq));
  assert_param(IS_HRTIM_CHOPPER_DUTYCYCLE(pChopperModeCfg->DutyCycle));
  assert_param(IS_HRTIM_CHOPPER_PULSEWIDTH(pChopperModeCfg->StartPulse));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Set timer choppe mode configuration */
  hrtim_chpr = (pChopperModeCfg->CarrierFreq & HRTIM_CHPR_CARFRQ);
  hrtim_chpr |= (pChopperModeCfg->DutyCycle & HRTIM_CHPR_CARDTY);
  hrtim_chpr |= (pChopperModeCfg->StartPulse & HRTIM_CHPR_STRPW);

  /* Update the HRTIM registers */
  MODIFY_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].CHPxR,
             (HRTIM_CHPR_CARFRQ | HRTIM_CHPR_CARDTY | HRTIM_CHPR_STRPW),
             hrtim_chpr);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the burst DMA controller for a timer
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                  This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  RegistersToUpdate registers to be written by DMA
 *                    This parameter can be any combination of the following
 * values:
 *                    @arg HRTIM_BURSTDMA_CR: HRTIM_MCR or HRTIM_TIMxCR
 *                    @arg HRTIM_BURSTDMA_ICR: HRTIM_MICR or HRTIM_TIMxICR
 *                    @arg HRTIM_BURSTDMA_DIER: HRTIM_MDIER or HRTIM_TIMxDIER
 *                    @arg HRTIM_BURSTDMA_CNT: HRTIM_MCNT or HRTIM_TIMxCNT
 *                    @arg HRTIM_BURSTDMA_PER: HRTIM_MPER or HRTIM_TIMxPER
 *                    @arg HRTIM_BURSTDMA_REP: HRTIM_MREP or HRTIM_TIMxREP
 *                    @arg HRTIM_BURSTDMA_CMP1: HRTIM_MCMP1 or HRTIM_TIMxCMP1
 *                    @arg HRTIM_BURSTDMA_CMP2: HRTIM_MCMP2 or HRTIM_TIMxCMP2
 *                    @arg HRTIM_BURSTDMA_CMP3: HRTIM_MCMP3 or HRTIM_TIMxCMP3
 *                    @arg HRTIM_BURSTDMA_CMP4: HRTIM_MCMP4 or HRTIM_TIMxCMP4
 *                    @arg HRTIM_BURSTDMA_DTR: HRTIM_TIMxDTR
 *                    @arg HRTIM_BURSTDMA_SET1R: HRTIM_TIMxSET1R
 *                    @arg HRTIM_BURSTDMA_RST1R: HRTIM_TIMxRST1R
 *                    @arg HRTIM_BURSTDMA_SET2R: HRTIM_TIMxSET2R
 *                    @arg HRTIM_BURSTDMA_RST2R: HRTIM_TIMxRST2R
 *                    @arg HRTIM_BURSTDMA_EEFR1: HRTIM_TIMxEEFR1
 *                    @arg HRTIM_BURSTDMA_EEFR2: HRTIM_TIMxEEFR2
 *                    @arg HRTIM_BURSTDMA_RSTR: HRTIM_TIMxRSTR
 *                    @arg HRTIM_BURSTDMA_CHPR: HRTIM_TIMxCHPR
 *                    @arg HRTIM_BURSTDMA_OUTR: HRTIM_TIMxOUTR
 *                    @arg HRTIM_BURSTDMA_FLTR: HRTIM_TIMxFLTR
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef HAL_HRTIM_BurstDMAConfig(HRTIM_HandleTypeDef *hhrtim,
                                           uint32_t TimerIdx,
                                           uint32_t RegistersToUpdate) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_BURSTDMA(TimerIdx, RegistersToUpdate));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

