www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
    case HAL_HRTIM_ERRORCALLBACK_CB_ID:
      hhrtim->ErrorCallback = pCallback;
      break;

    case HAL_HRTIM_MSPINIT_CB_ID:
      hhrtim->MspInitCallback = pCallback;
      break;

    case HAL_HRTIM_MSPDEINIT_CB_ID:
      hhrtim->MspDeInitCallback = pCallback;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else if (HAL_HRTIM_STATE_RESET == hhrtim->State) {
    switch (CallbackID) {
    case HAL_HRTIM_MSPINIT_CB_ID:
      hhrtim->MspInitCallback = pCallback;
      break;

    case HAL_HRTIM_MSPDEINIT_CB_ID:
      hhrtim->MspDeInitCallback = pCallback;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else {
    /* Update the state */
    hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

    /* Return error status */
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hhrtim);

  return status;
}

/**
 * @brief  HRTIM callback function un-registration
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  CallbackID ID of the HRTIM callback function to unregister
 *                   This parameter can be one of the following values:
 *                   @arg HAL_HRTIM_FAULT1CALLBACK_CB_ID
 *                   @arg HAL_HRTIM_FAULT2CALLBACK_CB_ID
 *                   @arg HAL_HRTIM_FAULT3CALLBACK_CB_ID
 *                   @arg HAL_HRTIM_FAULT4CALLBACK_CB_ID
 *                   @arg HAL_HRTIM_FAULT5CALLBACK_CB_ID
 *                   @arg HAL_HRTIM_SYSTEMFAULTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_DLLCALBRATIONREADYCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_BURSTMODEPERIODCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_SYNCHRONIZATIONEVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_ERRORCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_MSPINIT_CB_ID
 *                   @arg HAL_HRTIM_MSPDEINIT_CB_ID
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_UnRegisterCallback(HRTIM_HandleTypeDef *hhrtim,
                             HAL_HRTIM_CallbackIDTypeDef CallbackID) {
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hhrtim);

  if (HAL_HRTIM_STATE_READY == hhrtim->State) {
    switch (CallbackID) {
    case HAL_HRTIM_FAULT1CALLBACK_CB_ID:
      hhrtim->Fault1Callback = HAL_HRTIM_Fault1Callback;
      break;

    case HAL_HRTIM_FAULT2CALLBACK_CB_ID:
      hhrtim->Fault2Callback = HAL_HRTIM_Fault2Callback;
      break;

    case HAL_HRTIM_FAULT3CALLBACK_CB_ID:
      hhrtim->Fault3Callback = HAL_HRTIM_Fault3Callback;
      break;

    case HAL_HRTIM_FAULT4CALLBACK_CB_ID:
      hhrtim->Fault4Callback = HAL_HRTIM_Fault4Callback;
      break;

    case HAL_HRTIM_FAULT5CALLBACK_CB_ID:
      hhrtim->Fault5Callback = HAL_HRTIM_Fault5Callback;
      break;

    case HAL_HRTIM_SYSTEMFAULTCALLBACK_CB_ID:
      hhrtim->SystemFaultCallback = HAL_HRTIM_SystemFaultCallback;
      break;

    case HAL_HRTIM_DLLCALBRATIONREADYCALLBACK_CB_ID:
      hhrtim->DLLCalibrationReadyCallback =
          HAL_HRTIM_DLLCalibrationReadyCallback;
      break;

    case HAL_HRTIM_BURSTMODEPERIODCALLBACK_CB_ID:
      hhrtim->BurstModePeriodCallback = HAL_HRTIM_BurstModePeriodCallback;
      break;

    case HAL_HRTIM_SYNCHRONIZATIONEVENTCALLBACK_CB_ID:
      hhrtim->SynchronizationEventCallback =
          HAL_HRTIM_SynchronizationEventCallback;
      break;

    case HAL_HRTIM_ERRORCALLBACK_CB_ID:
      hhrtim->ErrorCallback = HAL_HRTIM_ErrorCallback;
      break;

    case HAL_HRTIM_MSPINIT_CB_ID:
      hhrtim->MspInitCallback = HAL_HRTIM_MspInit;
      break;

    case HAL_HRTIM_MSPDEINIT_CB_ID:
      hhrtim->MspDeInitCallback = HAL_HRTIM_MspDeInit;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else if (HAL_HRTIM_STATE_RESET == hhrtim->State) {
    switch (CallbackID) {
    case HAL_HRTIM_MSPINIT_CB_ID:
      hhrtim->MspInitCallback = HAL_HRTIM_MspInit;
      break;

    case HAL_HRTIM_MSPDEINIT_CB_ID:
      hhrtim->MspDeInitCallback = HAL_HRTIM_MspDeInit;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else {
    /* Update the state */
    hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

    /* Return error status */
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hhrtim);

  return status;
}

/**
 * @brief  HRTIM Timer x callback function registration
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  CallbackID ID of the HRTIM Timer x callback function to register
 *                   This parameter can be one of the following values:
 *                   @arg HAL_HRTIM_REGISTERSUPDATECALLBACK_CB_ID
 *                   @arg HAL_HRTIM_REPETITIONEVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE1EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE2EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE3EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE4EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_CAPTURE1EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_CAPTURE2EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_DELAYEDPROTECTIONCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COUNTERRESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT1SETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT1RESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT2SETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT2RESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_BURSTDMATRANSFERCALLBACK_CB_ID
 * @param  pCallback Callback function pointer
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_TIMxRegisterCallback(HRTIM_HandleTypeDef *hhrtim,
                               HAL_HRTIM_CallbackIDTypeDef CallbackID,
                               pHRTIM_TIMxCallbackTypeDef pCallback) {
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL) {
    /* Update the state */
    hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(hhrtim);

  if (HAL_HRTIM_STATE_READY == hhrtim->State) {
    switch (CallbackID) {
    case HAL_HRTIM_REGISTERSUPDATECALLBACK_CB_ID:
      hhrtim->RegistersUpdateCallback = pCallback;
      break;

    case HAL_HRTIM_REPETITIONEVENTCALLBACK_CB_ID:
      hhrtim->RepetitionEventCallback = pCallback;
      break;

    case HAL_HRTIM_COMPARE1EVENTCALLBACK_CB_ID:
      hhrtim->Compare1EventCallback = pCallback;
      break;

