www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
    case HAL_HRTIM_COMPARE2EVENTCALLBACK_CB_ID:
      hhrtim->Compare2EventCallback = pCallback;
      break;

    case HAL_HRTIM_COMPARE3EVENTCALLBACK_CB_ID:
      hhrtim->Compare3EventCallback = pCallback;
      break;

    case HAL_HRTIM_COMPARE4EVENTCALLBACK_CB_ID:
      hhrtim->Compare4EventCallback = pCallback;
      break;

    case HAL_HRTIM_CAPTURE1EVENTCALLBACK_CB_ID:
      hhrtim->Capture1EventCallback = pCallback;
      break;

    case HAL_HRTIM_CAPTURE2EVENTCALLBACK_CB_ID:
      hhrtim->Capture2EventCallback = pCallback;
      break;

    case HAL_HRTIM_DELAYEDPROTECTIONCALLBACK_CB_ID:
      hhrtim->DelayedProtectionCallback = pCallback;
      break;

    case HAL_HRTIM_COUNTERRESETCALLBACK_CB_ID:
      hhrtim->CounterResetCallback = pCallback;
      break;

    case HAL_HRTIM_OUTPUT1SETCALLBACK_CB_ID:
      hhrtim->Output1SetCallback = pCallback;
      break;

    case HAL_HRTIM_OUTPUT1RESETCALLBACK_CB_ID:
      hhrtim->Output1ResetCallback = pCallback;
      break;

    case HAL_HRTIM_OUTPUT2SETCALLBACK_CB_ID:
      hhrtim->Output2SetCallback = pCallback;
      break;

    case HAL_HRTIM_OUTPUT2RESETCALLBACK_CB_ID:
      hhrtim->Output2ResetCallback = pCallback;
      break;

    case HAL_HRTIM_BURSTDMATRANSFERCALLBACK_CB_ID:
      hhrtim->BurstDMATransferCallback = pCallback;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else {
    /* Update the state */
    hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

    /* Return error status */
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hhrtim);

  return status;
}

/**
 * @brief  HRTIM Timer x callback function un-registration
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  CallbackID ID of the HRTIM callback Timer x function to unregister
 *                   This parameter can be one of the following values:
 *                   @arg HAL_HRTIM_REGISTERSUPDATECALLBACK_CB_ID
 *                   @arg HAL_HRTIM_REPETITIONEVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE1EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE2EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE3EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COMPARE4EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_CAPTURE1EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_CAPTURE2EVENTCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_DELAYEDPROTECTIONCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_COUNTERRESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT1SETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT1RESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT2SETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_OUTPUT2RESETCALLBACK_CB_ID
 *                   @arg HAL_HRTIM_BURSTDMATRANSFERCALLBACK_CB_ID
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_TIMxUnRegisterCallback(HRTIM_HandleTypeDef *hhrtim,
                                 HAL_HRTIM_CallbackIDTypeDef CallbackID) {
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hhrtim);

  if (HAL_HRTIM_STATE_READY == hhrtim->State) {
    switch (CallbackID) {
    case HAL_HRTIM_REGISTERSUPDATECALLBACK_CB_ID:
      hhrtim->RegistersUpdateCallback = HAL_HRTIM_RegistersUpdateCallback;
      break;

    case HAL_HRTIM_REPETITIONEVENTCALLBACK_CB_ID:
      hhrtim->RepetitionEventCallback = HAL_HRTIM_RepetitionEventCallback;
      break;

    case HAL_HRTIM_COMPARE1EVENTCALLBACK_CB_ID:
      hhrtim->Compare1EventCallback = HAL_HRTIM_Compare1EventCallback;
      break;

    case HAL_HRTIM_COMPARE2EVENTCALLBACK_CB_ID:
      hhrtim->Compare2EventCallback = HAL_HRTIM_Compare2EventCallback;
      break;

    case HAL_HRTIM_COMPARE3EVENTCALLBACK_CB_ID:
      hhrtim->Compare3EventCallback = HAL_HRTIM_Compare3EventCallback;
      break;

    case HAL_HRTIM_COMPARE4EVENTCALLBACK_CB_ID:
      hhrtim->Compare4EventCallback = HAL_HRTIM_Compare4EventCallback;
      break;

    case HAL_HRTIM_CAPTURE1EVENTCALLBACK_CB_ID:
      hhrtim->Capture1EventCallback = HAL_HRTIM_Capture1EventCallback;
      break;

    case HAL_HRTIM_CAPTURE2EVENTCALLBACK_CB_ID:
      hhrtim->Capture2EventCallback = HAL_HRTIM_Capture2EventCallback;
      break;

    case HAL_HRTIM_DELAYEDPROTECTIONCALLBACK_CB_ID:
      hhrtim->DelayedProtectionCallback = HAL_HRTIM_DelayedProtectionCallback;
      break;

    case HAL_HRTIM_COUNTERRESETCALLBACK_CB_ID:
      hhrtim->CounterResetCallback = HAL_HRTIM_CounterResetCallback;
      break;

    case HAL_HRTIM_OUTPUT1SETCALLBACK_CB_ID:
      hhrtim->Output1SetCallback = HAL_HRTIM_Output1SetCallback;
      break;

    case HAL_HRTIM_OUTPUT1RESETCALLBACK_CB_ID:
      hhrtim->Output1ResetCallback = HAL_HRTIM_Output1ResetCallback;
      break;

    case HAL_HRTIM_OUTPUT2SETCALLBACK_CB_ID:
      hhrtim->Output2SetCallback = HAL_HRTIM_Output2SetCallback;
      break;

    case HAL_HRTIM_OUTPUT2RESETCALLBACK_CB_ID:
      hhrtim->Output2ResetCallback = HAL_HRTIM_Output2ResetCallback;
      break;

    case HAL_HRTIM_BURSTDMATRANSFERCALLBACK_CB_ID:
      hhrtim->BurstDMATransferCallback = HAL_HRTIM_BurstDMATransferCallback;
      break;

    default:
      /* Update the state */
      hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

      /* Return error status */
      status = HAL_ERROR;
      break;
    }
  } else {
    /* Update the state */
    hhrtim->State = HAL_HRTIM_STATE_INVALID_CALLBACK;

    /* Return error status */
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hhrtim);

  return status;
}
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup HRTIM_Private_Functions
 * @{
 */

/**
 * @brief  Configure the master timer time base
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  pTimeBaseCfg pointer to the time base configuration structure
 * @retval None
 */
static void
HRTIM_MasterBase_Config(HRTIM_HandleTypeDef *hhrtim,
                        const HRTIM_TimeBaseCfgTypeDef *pTimeBaseCfg) {
  uint32_t hrtim_mcr;

