www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
  case HRTIM_EVENT_6: {
    hrtim_eecr2 &=
        ~(HRTIM_EECR2_EE6SRC | HRTIM_EECR2_EE6POL | HRTIM_EECR2_EE6SNS);
    hrtim_eecr2 |= (pEventCfg->Source & HRTIM_EECR2_EE6SRC);
    hrtim_eecr2 |= (pEventCfg->Polarity & HRTIM_EECR2_EE6POL);
    hrtim_eecr2 |= (pEventCfg->Sensitivity & HRTIM_EECR2_EE6SNS);
    hrtim_eecr3 &= ~(HRTIM_EECR3_EE6F);
    hrtim_eecr3 |= (pEventCfg->Filter & HRTIM_EECR3_EE6F);
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR2 = hrtim_eecr2;
    hhrtim->Instance->sCommonRegs.EECR3 = hrtim_eecr3;
    break;
  }

  case HRTIM_EVENT_7: {
    hrtim_eecr2 &=
        ~(HRTIM_EECR2_EE7SRC | HRTIM_EECR2_EE7POL | HRTIM_EECR2_EE7SNS);
    hrtim_eecr2 |= ((pEventCfg->Source << 6U) & HRTIM_EECR2_EE7SRC);
    hrtim_eecr2 |= ((pEventCfg->Polarity << 6U) & HRTIM_EECR2_EE7POL);
    hrtim_eecr2 |= ((pEventCfg->Sensitivity << 6U) & HRTIM_EECR2_EE7SNS);
    hrtim_eecr3 &= ~(HRTIM_EECR3_EE7F);
    hrtim_eecr3 |= ((pEventCfg->Filter << 6U) & HRTIM_EECR3_EE7F);
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR2 = hrtim_eecr2;
    hhrtim->Instance->sCommonRegs.EECR3 = hrtim_eecr3;
    break;
  }

  case HRTIM_EVENT_8: {
    hrtim_eecr2 &=
        ~(HRTIM_EECR2_EE8SRC | HRTIM_EECR2_EE8POL | HRTIM_EECR2_EE8SNS);
    hrtim_eecr2 |= ((pEventCfg->Source << 12U) & HRTIM_EECR2_EE8SRC);
    hrtim_eecr2 |= ((pEventCfg->Polarity << 12U) & HRTIM_EECR2_EE8POL);
    hrtim_eecr2 |= ((pEventCfg->Sensitivity << 12U) & HRTIM_EECR2_EE8SNS);
    hrtim_eecr3 &= ~(HRTIM_EECR3_EE8F);
    hrtim_eecr3 |= ((pEventCfg->Filter << 12U) & HRTIM_EECR3_EE8F);
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR2 = hrtim_eecr2;
    hhrtim->Instance->sCommonRegs.EECR3 = hrtim_eecr3;
    break;
  }

  case HRTIM_EVENT_9: {
    hrtim_eecr2 &=
        ~(HRTIM_EECR2_EE9SRC | HRTIM_EECR2_EE9POL | HRTIM_EECR2_EE9SNS);
    hrtim_eecr2 |= ((pEventCfg->Source << 18U) & HRTIM_EECR2_EE9SRC);
    hrtim_eecr2 |= ((pEventCfg->Polarity << 18U) & HRTIM_EECR2_EE9POL);
    hrtim_eecr2 |= ((pEventCfg->Sensitivity << 18U) & HRTIM_EECR2_EE9SNS);
    hrtim_eecr3 &= ~(HRTIM_EECR3_EE9F);
    hrtim_eecr3 |= ((pEventCfg->Filter << 18U) & HRTIM_EECR3_EE9F);
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR2 = hrtim_eecr2;
    hhrtim->Instance->sCommonRegs.EECR3 = hrtim_eecr3;
    break;
  }

  case HRTIM_EVENT_10: {
    hrtim_eecr2 &=
        ~(HRTIM_EECR2_EE10SRC | HRTIM_EECR2_EE10POL | HRTIM_EECR2_EE10SNS);
    hrtim_eecr2 |= ((pEventCfg->Source << 24U) & HRTIM_EECR2_EE10SRC);
    hrtim_eecr2 |= ((pEventCfg->Polarity << 24U) & HRTIM_EECR2_EE10POL);
    hrtim_eecr2 |= ((pEventCfg->Sensitivity << 24U) & HRTIM_EECR2_EE10SNS);
    hrtim_eecr3 &= ~(HRTIM_EECR3_EE10F);
    hrtim_eecr3 |= ((pEventCfg->Filter << 24U) & HRTIM_EECR3_EE10F);
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR2 = hrtim_eecr2;
    hhrtim->Instance->sCommonRegs.EECR3 = hrtim_eecr3;
    break;
  }

  default:
    break;
  }
}

/**
 * @brief  Configure the timer counter reset
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @param  Event Event channel identifier
 * @retval None
 */
static void HRTIM_TIM_ResetConfig(HRTIM_HandleTypeDef *hhrtim,
                                  uint32_t TimerIdx, uint32_t Event) {
  switch (Event) {
  case HRTIM_EVENT_1: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_1;
    break;
  }

  case HRTIM_EVENT_2: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_2;
    break;
  }

  case HRTIM_EVENT_3: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_3;
    break;
  }

  case HRTIM_EVENT_4: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_4;
    break;
  }

  case HRTIM_EVENT_5: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_5;
    break;
  }

  case HRTIM_EVENT_6: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_6;
    break;
  }

  case HRTIM_EVENT_7: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_7;
    break;
  }

  case HRTIM_EVENT_8: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_8;
    break;
  }

  case HRTIM_EVENT_9: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = HRTIM_TIMRESETTRIGGER_EEV_9;
    break;
  }

  case HRTIM_EVENT_10: {
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR =
        HRTIM_TIMRESETTRIGGER_EEV_10;
    break;
  }

  default:
    break;
  }
}

/**
 * @brief  Return the interrupt to enable or disable according to the
 *         OC mode.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval Interrupt to enable or disable
 */
static uint32_t HRTIM_GetITFromOCMode(const HRTIM_HandleTypeDef *hhrtim,
                                      uint32_t TimerIdx, uint32_t OCChannel) {
  uint32_t hrtim_set;
  uint32_t hrtim_reset;
  uint32_t interrupt = 0U;

  switch (OCChannel) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    /* Retreives actual OC mode and set interrupt accordingly */
    hrtim_set = hhrtim->Instance->sTimerxRegs[TimerIdx].SETx1R;
    hrtim_reset = hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx1R;

