www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
    if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP1) == HRTIM_OUTPUTSET_TIMCMP1) &&
        ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP1) ==
         HRTIM_OUTPUTRESET_TIMCMP1)) {
      /* OC mode: HRTIM_BASICOCMODE_TOGGLE */
      interrupt = HRTIM_TIM_IT_CMP1;
    } else if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP1) ==
                HRTIM_OUTPUTSET_TIMCMP1) &&
               (hrtim_reset == 0U)) {
      /* OC mode: HRTIM_BASICOCMODE_ACTIVE */
      interrupt = HRTIM_TIM_IT_SET1;
    } else if ((hrtim_set == 0U) &&
               ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP1) ==
                HRTIM_OUTPUTRESET_TIMCMP1)) {
      /* OC mode: HRTIM_BASICOCMODE_INACTIVE */
      interrupt = HRTIM_TIM_IT_RST1;
    } else {
      /* nothing to do */
    }
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    /* Retreives actual OC mode and set interrupt accordingly */
    hrtim_set = hhrtim->Instance->sTimerxRegs[TimerIdx].SETx2R;
    hrtim_reset = hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx2R;

    if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP2) == HRTIM_OUTPUTSET_TIMCMP2) &&
        ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP2) ==
         HRTIM_OUTPUTRESET_TIMCMP2)) {
      /* OC mode: HRTIM_BASICOCMODE_TOGGLE */
      interrupt = HRTIM_TIM_IT_CMP2;
    } else if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP2) ==
                HRTIM_OUTPUTSET_TIMCMP2) &&
               (hrtim_reset == 0U)) {
      /* OC mode: HRTIM_BASICOCMODE_ACTIVE */
      interrupt = HRTIM_TIM_IT_SET2;
    } else if ((hrtim_set == 0U) &&
               ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP2) ==
                HRTIM_OUTPUTRESET_TIMCMP2)) {
      /* OC mode: HRTIM_BASICOCMODE_INACTIVE */
      interrupt = HRTIM_TIM_IT_RST2;
    } else {
      /* nothing to do */
    }
    break;
  }

  default:
    break;
  }

  return interrupt;
}

/**
 * @brief  Return the DMA request to enable or disable according to the
 *         OC mode.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval DMA request to enable or disable
 */
static uint32_t HRTIM_GetDMAFromOCMode(const HRTIM_HandleTypeDef *hhrtim,
                                       uint32_t TimerIdx, uint32_t OCChannel) {
  uint32_t hrtim_set;
  uint32_t hrtim_reset;
  uint32_t dma_request = 0U;

  switch (OCChannel) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    /* Retreives actual OC mode and set dma_request accordingly */
    hrtim_set = hhrtim->Instance->sTimerxRegs[TimerIdx].SETx1R;
    hrtim_reset = hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx1R;

    if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP1) == HRTIM_OUTPUTSET_TIMCMP1) &&
        ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP1) ==
         HRTIM_OUTPUTRESET_TIMCMP1)) {
      /* OC mode: HRTIM_BASICOCMODE_TOGGLE */
      dma_request = HRTIM_TIM_DMA_CMP1;
    } else if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP1) ==
                HRTIM_OUTPUTSET_TIMCMP1) &&
               (hrtim_reset == 0U)) {
      /* OC mode: HRTIM_BASICOCMODE_ACTIVE */
      dma_request = HRTIM_TIM_DMA_SET1;
    } else if ((hrtim_set == 0U) &&
               ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP1) ==
                HRTIM_OUTPUTRESET_TIMCMP1)) {
      /* OC mode: HRTIM_BASICOCMODE_INACTIVE */
      dma_request = HRTIM_TIM_DMA_RST1;
    } else {
      /* nothing to do */
    }
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    /* Retreives actual OC mode and set dma_request accordingly */
    hrtim_set = hhrtim->Instance->sTimerxRegs[TimerIdx].SETx2R;
    hrtim_reset = hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx2R;

    if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP2) == HRTIM_OUTPUTSET_TIMCMP2) &&
        ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP2) ==
         HRTIM_OUTPUTRESET_TIMCMP2)) {
      /* OC mode: HRTIM_BASICOCMODE_TOGGLE */
      dma_request = HRTIM_TIM_DMA_CMP2;
    } else if (((hrtim_set & HRTIM_OUTPUTSET_TIMCMP2) ==
                HRTIM_OUTPUTSET_TIMCMP2) &&
               (hrtim_reset == 0U)) {
      /* OC mode: HRTIM_BASICOCMODE_ACTIVE */
      dma_request = HRTIM_TIM_DMA_SET2;
    } else if ((hrtim_set == 0U) &&
               ((hrtim_reset & HRTIM_OUTPUTRESET_TIMCMP2) ==
                HRTIM_OUTPUTRESET_TIMCMP2)) {
      /* OC mode: HRTIM_BASICOCMODE_INACTIVE */
      dma_request = HRTIM_TIM_DMA_RST2;
    } else {
      /* nothing to do */
    }
    break;
  }

  default:
    break;
  }

  return dma_request;
}

static DMA_HandleTypeDef *
HRTIM_GetDMAHandleFromTimerIdx(const HRTIM_HandleTypeDef *hhrtim,
                               uint32_t TimerIdx) {
  DMA_HandleTypeDef *hdma = (DMA_HandleTypeDef *)NULL;

  switch (TimerIdx) {
  case HRTIM_TIMERINDEX_MASTER: {
    hdma = hhrtim->hdmaMaster;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_A: {
    hdma = hhrtim->hdmaTimerA;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_B: {
    hdma = hhrtim->hdmaTimerB;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_C: {
    hdma = hhrtim->hdmaTimerC;
    break;
  }

