www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205259.c
  case HRTIM_TIMERINDEX_TIMER_D: {
    hdma = hhrtim->hdmaTimerD;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_E: {
    hdma = hhrtim->hdmaTimerE;
    break;
  }

  default:
    break;
  }

  return hdma;
}

static uint32_t GetTimerIdxFromDMAHandle(const HRTIM_HandleTypeDef *hhrtim,
                                         const DMA_HandleTypeDef *hdma) {
  uint32_t timed_idx = 0xFFFFFFFFU;

  if (hdma == hhrtim->hdmaMaster) {
    timed_idx = HRTIM_TIMERINDEX_MASTER;
  } else if (hdma == hhrtim->hdmaTimerA) {
    timed_idx = HRTIM_TIMERINDEX_TIMER_A;
  } else if (hdma == hhrtim->hdmaTimerB) {
    timed_idx = HRTIM_TIMERINDEX_TIMER_B;
  } else if (hdma == hhrtim->hdmaTimerC) {
    timed_idx = HRTIM_TIMERINDEX_TIMER_C;
  } else if (hdma == hhrtim->hdmaTimerD) {
    timed_idx = HRTIM_TIMERINDEX_TIMER_D;
  } else if (hdma == hhrtim->hdmaTimerE) {
    timed_idx = HRTIM_TIMERINDEX_TIMER_E;
  } else {
    /* nothing to do */
  }
  return timed_idx;
}

/**
 * @brief  Force an immediate transfer from the preload to the active
 *         registers.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @retval None
 */
static void HRTIM_ForceRegistersUpdate(HRTIM_HandleTypeDef *hhrtim,
                                       uint32_t TimerIdx) {
  switch (TimerIdx) {
  case HRTIM_TIMERINDEX_MASTER: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_MSWU;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_A: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_TASWU;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_B: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_TBSWU;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_C: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_TCSWU;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_D: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_TDSWU;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_E: {
    hhrtim->Instance->sCommonRegs.CR2 |= HRTIM_CR2_TESWU;
    break;
  }

  default:
    break;
  }
}

/**
 * @brief  HRTIM interrupts service routine
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
static void HRTIM_HRTIM_ISR(HRTIM_HandleTypeDef *hhrtim) {
  uint32_t isrflags = READ_REG(hhrtim->Instance->sCommonRegs.ISR);
  uint32_t ierits = READ_REG(hhrtim->Instance->sCommonRegs.IER);

  /* Fault 1 event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_FLT1) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_FLT1) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_FLT1);

      /* Invoke Fault 1 event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->Fault1Callback(hhrtim);
#else
      HAL_HRTIM_Fault1Callback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Fault 2 event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_FLT2) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_FLT2) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_FLT2);

      /* Invoke Fault 2 event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->Fault2Callback(hhrtim);
#else
      HAL_HRTIM_Fault2Callback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Fault 3 event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_FLT3) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_FLT3) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_FLT3);

      /* Invoke Fault 3 event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->Fault3Callback(hhrtim);
#else
      HAL_HRTIM_Fault3Callback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Fault 4 event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_FLT4) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_FLT4) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_FLT4);

      /* Invoke Fault 4 event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->Fault4Callback(hhrtim);
#else
      HAL_HRTIM_Fault4Callback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Fault 5 event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_FLT5) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_FLT5) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_FLT5);

      /* Invoke Fault 5 event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->Fault5Callback(hhrtim);
#else
      HAL_HRTIM_Fault5Callback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* System fault event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_SYSFLT) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_SYSFLT) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_SYSFLT);

      /* Invoke System fault event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->SystemFaultCallback(hhrtim);
#else
      HAL_HRTIM_SystemFaultCallback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }
}

/**
 * @brief  Master timer interrupts service routine
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
static void HRTIM_Master_ISR(HRTIM_HandleTypeDef *hhrtim) {
  uint32_t isrflags = READ_REG(hhrtim->Instance->sCommonRegs.ISR);
  uint32_t ierits = READ_REG(hhrtim->Instance->sCommonRegs.IER);
  uint32_t misrflags = READ_REG(hhrtim->Instance->sMasterRegs.MISR);
  uint32_t mdierits = READ_REG(hhrtim->Instance->sMasterRegs.MDIER);

  /* DLL calibration ready event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_DLLRDY) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_DLLRDY) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_DLLRDY);

      /* Set HRTIM State */
      hhrtim->State = HAL_HRTIM_STATE_READY;

      /* Process unlocked */
      __HAL_UNLOCK(hhrtim);

      /* Invoke System fault event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->DLLCalibrationReadyCallback(hhrtim);
#else
      HAL_HRTIM_DLLCalibrationReadyCallback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Burst mode period event */
  if ((uint32_t)(isrflags & HRTIM_FLAG_BMPER) != (uint32_t)RESET) {
    if ((uint32_t)(ierits & HRTIM_IT_BMPER) != (uint32_t)RESET) {
      __HAL_HRTIM_CLEAR_IT(hhrtim, HRTIM_IT_BMPER);

      /* Invoke Burst mode period event callback */
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
      hhrtim->BurstModePeriodCallback(hhrtim);
#else
      HAL_HRTIM_BurstModePeriodCallback(hhrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
    }
  }

  /* Master timer compare 1 event */
  if ((uint32_t)(misrflags & HRTIM_MASTER_FLAG_MCMP1) != (uint32_t)RESET) {
    if ((uint32_t)(mdierits & HRTIM_MASTER_IT_MCMP1) != (uint32_t)RESET) {
      __HAL_HRTIM_MASTER_CLEAR_IT(hhrtim, HRTIM_MASTER_IT_MCMP1);

